HELLO_MESSAGE = (
    'Я - <b><i>EcoBot</i></b>. Компактный справочник по экологической культуре.\n\n' +
    'Здесь вы найдёте информацию об экологии, расширите свои знания, сможете найти значение экологических терминов.\n\n'+
    'А теперь, загляните в меню снизу или напишите мне команду <b>помощь</b>.'
)


HELP_MESSAGE = (
    'Помощь бота\n' +
    'Чтобы я исполнил команду, напишите её мне.\n\n' +
    'Список команд: \n'
    '<b>Привет</b> - <i>приветствие от бота</i>\n' +
    '<b>Помощь</b> - <i>показать список моих команд</i>\n' +
    '<b>Меню</b> - <i>показать главное меню</i>\n' +
    '<b>Эко</b> - <i>показать раздел об экологии</i>\n' +
    '<b>О боте</b> - <i>показать техническую информацию</i>\n' +
    '<b>Зачем</b> - <i>показать информацию о предназначении бота</i>\n' +
    '<b>Словарь</b> - <i>показать словарь</i>'
)


MENU_MESSAGE = (
    'Главное меню'
)


UNKNOWN_COMMAND_MESSAGE = (
    'Я не знаю такую команду 😵\nПроверьте ваше сообщение или напишите мне <b>помощь</b>.'
)

PYTHON_VERSION = 'Python 3.8.2'
BOT_VERSION = '1.0'
API_VERSION = 'pyTelegramBotAPI 3.7.0'
DEV_EMAIL = 'goraleksey.jr@gmail.com'
DEV_TELEGRAM = '@Chronos196'
HOSTING_URL = 'heroku.com'
ABOUT_BOT_MESSAGE = (
    'Техническая информация о боте: \n\n' +
    '<b><i>EcoBot</i></b>, версия <i>' + BOT_VERSION + '</i>\n' +
    'Написан на: <i>' + PYTHON_VERSION + '</i>\n' +
    'API: <i>' + API_VERSION + '</i>\n' +
    'Хостинг: <i>' + HOSTING_URL + '</i>\n\n'
    'Связаться с разработчиком: <i>' + DEV_EMAIL + '</i> или <i>' + DEV_TELEGRAM + '</i>'
)


WHY_IS_BOT_MESSAGE = (
    'Для чего этот бот?\n\n' +
    'Для формирования правильного экологического мировозрения и ' +
    'понимания важности гармоничного существования с природой, ' +
    'каждый человек должен иметь представление об экологии.\n\n' +
    'С каждым годом мы слышим о загрязнении окружающей среды, ' +
    'для предотвращения этого мы должны не только понимать ' +
    'принципы экологии, но и изменить образ жизни, сформировать так называемые эко-привычки.\n\n' +
    'Телеграм-бот представляет из себя компактный мини-справочник. ' +
    'Здесь представлены полезные рекомендации об экологических привычках, ' +
    'полезные статьи на тему экологии, расширяющие знания, а ' +
    'также небольшой словарь, где содержатся определения экологических терминов. ' +
    'Всё это создано для распространения экологической культуры жизни, ' +
    'так как экологическая культура начинается с изменения образа жизни ' +
    'каждого отдельного человека. Только начав с себя, можно изменить этот мир к лучшему.\n\n' +
    'ЭкоБот поможет получить вам нужную информацию, не забывайте ' +
    'рассказывать о нём друзьям, распространение экологической культуры жизни необходимо, ' +
    'а различные соцсети и другие сетевые технологии облегчают и ускоряют этот процесс.\n\n' +
    'Не забывайте, что бот обновляется и с каждым разом информации будет становиться ' +
    'всё больше и больше. Если вы нашли ошибку или хотите что-либо предложить, ' +
    'пожалуйста, напишите мне об этом. Мои контакты указаны в разделе "О боте".'
)


ECOLOGY_MESSAGES = (
    'Об экологии\n' +
    'Здесь представлена основная информация бота, связанная с экологией.'
)


CULTURE_MESSAGES = (
    'Экологическая культура\n\n' +
    '<b><i>Экологическая культура</i></b> - это система знаний, ценностей, принципов, ' +
    'направленных на ответственное отношение к природе и реализацию людских потребностей, ' +
    'не создавая угрозу жизни на Земле. \n\n' +
    'Процесс формирования эко-культуры называется <i>«экологическим просвещением»</i> ' +
    'Такая деятельность складывается из распространения экологических знаний, ' +
    'а также воспитания бережного отношения к окружающей среде и рационального ' +
    'использования природных ресурсов.'
)


NECESSARY_MESSAGE = (
    '<b><i>Почему экологическая культура необходима?</i></b>\n\n' +
    'В XX веке человечество стало задумываться о своём разрушительном '+
    'влиянии на окружающую среду. Технический прогресс привёл не ' +
    'только к развитию технологий, но и к загрязнению природы и исчерпанию ресурсов. ' +
    'Решение глобальных проблем зависит не только от правительств стран, ' +
    'но и от каждого человека живущего на Земле. Одно из решений этой ' +
    'проблемы&#160;- формирование экологической культуры человека.\n\n'
    'Экологическая культура необходима каждому человеку, чтобы ' +
    'осознавать последствия своих действий для природы и понимать, ' +
    'как можно снизить негативное воздействие на окружающую среду.'
)


HOW_TO_FORM_MESSAGE = (
    '<b><i>Как формировать экологическую культуру?</i></b>\n\n' +
    'Экологическая культура должна быть непрерывно связана с человком ' +
    'начиная от дошкольного возраста и продолжаться в течении всей жизни человека. \n\n' +
    'В 2002 году был введён <a href = "http://www.consultant.ru/document/cons_doc_LAW_34823/ad4384f60932349374b984e7a7149192389ccd6f/">Федеральный закон «Об охране окружающей среды»</a>. ' +
    'Глава XIII содержит следующие основы формирования экологической культуры: \n' +
    '• Экологическое образование \n' +
    '• Подготовка руководителей организаций и специалистов в области охраны окружающей среды и экологической безопасности \n' +
    '• Экологическое просвещение\n\n' +
    'Для формирования экологической культуры необходимо внедрять в ' +
    'систему образования занятия, направленные на расширение знаний об окружающей среде.\n\n' +
    'Необходимо подготавливать квалифицированных специалистов в области экологии, ' +
    'ответственных за принятие хозяйственных решений, связанных с окружающей средой, ' +
    'а также специалистов, занимающихся эко-технологиями.\n\n' +
    'Экологическое просвещение предпологает информирование людей об основных экологических проблемах, ' +
    'способах их решения. Необходимо с помощью различных средств(СМИ, интернет, организации, учреждения культуры) ' +
    'рассказывать, как на практике можно помочь экологии: сортировать мусор, использовать многоразовую посуду, беречь воду и т.д.\n\n' +
    'Развитие экологической культуры ведёт к пониманию значимости экологической тематики, ' +
    'формированию экологически ориентированного мировоззрения и поведения.\n\n' +
    'Хотите уже сейчас помочь экологии и развить экологическую культуру? - ' +
    'начните выполнять простые эко-привычки и читать статьи.'
)


ECO_HABITS_MESSAGE = (
    '<b><i>Эко привычки</i></b>\n\n' +
    'Здесь представлены самые простые эко-привычки, ' +
    'их выполнение не составит вам особых усилий. ' +
    'Для более подробной информации загляните в раздел <b><i>статьи</i></b>.\n\n' +
    '• <b>Откажитесь от полиэтиленовых пакетов</b>&#160;- приобрите себе более долговечную тканевую сумку и ходите с ней в магазин. Она прослужит долго ' +
    'и вам не придёться использовать обычные полиэтиленовые пакеты.\n'
    '• <b>Сдавайте отходы в пункты приёма</b>&#160;- чтобы уменьшить количество свалок, относите бумагу, стекло, пластик и т.п в пункты приёма. ' +
    'Посмотреть пункты приёма можно на сайте recyclemap.ru (скоро появится возможность находить пункты приёма сразу в боте).\n' +
    '• <b>Экономьте дома воду и электричество</b>&#160;- выключайте свет и телевизор в комнате, когда там никого нет. Выключайте воду, когда чистите зубы, ' +
    'принимайте душ, а не ванную. Эти привычки не только берегут ресурсы, но и позволят вам сэкономить.\n' +
    '• <b>Используйте многоразовую посуду</b>&#160;- вместо обычных бутылок используйте многоразовые бутылки из плотного пластика. Такая бутылка ' +
    'служит дольше и не выделяет токсинов в воду. Постарайтесь меньше использовать пластиковую посуду.\n' +
    '• <b>Сортируйте дома мусор</b>&#160;- разделяйте перерабатываемый мусор дома: стекло, пластик, бумагу, алюминий. ' +
    'Это облегчит дальнейшую переработку мусора.\n' 
    '• <b>Меньше личного транспорта</b>&#160;- для не особо далёких мест подойдёт велосипед, вы сэкономите деньги, поможете экологии и улучшите ' +
    'своё здоровье. Общественный транспорт, такси и каршеринг также являются неплохим вариантом.\n' +
    '• <b>Не выбрасывайте ненужные вещи</b>&#160;- ненужную одежду продавайте или отдавайте в пункты приёма. Старые книги можно отдать ' +
    'библиотеке или передать в буккроссинг.\n' +
    '• <b>Покупайте вещи осознанно</b>&#160;- приобретайте долговечные вещи, вы будете меньше производить мусора и в вашем доме будет меньше захламления.\n' +
    '• <b>Избавляйтесь от опасных отходов правильно</b>&#160;- батарейки, лампы, термометры, бытовую химию и т.п. нельзя выкидывать в обычную мусорку. ' +
    'Относите их в пункты приёма. Батарейки, например, можно заменить многоразовыми аккамуляторами.\n' +
    '• <b>Интересуйтесь экологией и рассказывайте друзям об этом</b>&#160;- распространяйте экологическую культуру, всё зависит только от нас. ' +
    'Вместе мы сможим благотворно повлиять на наш окружающий мир.'
)


ARTICLES_MESSAGE = (
    'Статьи бота \n' +
    'Здесь представлены полезные статьи на тему экологии, которые помогут расширить ваши экологические знания.\n\n' +
    'Нажмите на кнопку <i>Список статей 📝</i>, чтобы увидеть все статьи или <i>Случайная статья 🎲</i>.'
)

DICTIONARY_MESSAGE = (
    'Словарь бота\n' +
    'Здесь вы можете просмотреть значения экологических терминов.\n\n' + 
    'Выберите раздел словаря или напишите мне <b>словарь термин</b>, где термин - искомое слово.\n' +
    'Например: <i>словарь экология</i>'
)


DICTIONARY_UNFOUND = (
    'Такого слова нет в словаре'
)
